app/controllers/geocode_controller.rb

  def index
    if cached_data.blank? || @cache == "false"
      result = JSON.parse(google_data)

      unless result["status"] == "OK"
        return handle_error("Could not compute coordinates for this address")
      end

      Geocode.where(query: @address)
        .first_or_create
        .update_attributes(geocode_data(result))
---
INSERT INTO "geocodes" ("query") VALUES ($1) RETURNING "id"  [["query", "feurigstrasse 99"]]
SELECT  "geocodes".* FROM "geocodes" WHERE "geocodes"."query" = $1 ORDER BY "geocodes"."id" ASC LIMIT $2  [["query", "feurigstrasse 42"], ["LIMIT", 1]]
UPDATE "geocodes" SET "latitude" = $1, "longitude" = $2, "address" = $3 WHERE "geocodes"."id" = $4  [["latitude", "52.4859893"], ["longitude", "13.3597295"], ["address", "Feurigstraße 99, 10827 Berlin, Germany"], ["id", 32]]

  def cached_data
    Geocode.find_by(query: @address)
---
SELECT  "geocodes".* FROM "geocodes" WHERE "geocodes"."query" = $1 LIMIT $2  [["query", "feurigstraße 99"], ["LIMIT", 1]]